SpectralForgeLabs/stm32f4-pipeline-demo/src/main.c
#include "FreeRTOS.h"
#include "task.h"
#include "blinky_task.h"
#include "uart_task.h"
#include "clock_stm32f4xx.h"
#include "stm32f4xx.h"
#include "timer.h"
#include "version.h"
#include "buildinfo.h"
#include "uart.h"

__attribute__((section(".builddata")))
const build_info_t build_info = {
  .git_sha      = GIT_SHA,
  .branch       = GIT_BRANCH,
  .build_number = BUILD_NUMBER,
};

/// @brief 
/// @param  
void vApplicationMallocFailedHook( void )
{
    /* vApplicationMallocFailedHook() will only be called if
    configUSE_MALLOC_FAILED_HOOK is set to 1 in FreeRTOSConfig.h.  It is a hook
    function that will get called if a call to pvPortMalloc() fails.
    pvPortMalloc() is called internally by the kernel whenever a task, queue,
    timer or semaphore is created.  It is also called by various parts of the
    demo application.  If heap_1.c or heap_2.c are used, then the size of the
    heap available to pvPortMalloc() is defined by configTOTAL_HEAP_SIZE in
    FreeRTOSConfig.h, and the xPortGetFreeHeapSize() API function can be used
    to query the size of free heap space that remains (although it does not
    provide information on how the remaining heap might be fragmented). */
    taskDISABLE_INTERRUPTS();
    while(1);
}

/// @brief 
/// @param  
void vApplicationTickHook( void )
{
    /* This function will be called by each tick interrupt if
    configUSE_TICK_HOOK is set to 1 in FreeRTOSConfig.h.  User code can be
    added here, but the tick hook is called from an interrupt context, so
    code must not attempt to block, and only the interrupt safe FreeRTOS API
    functions can be used (those that end in FromISR()).  */
}

/// @brief 
/// @param pxTask 
/// @param pcTaskName 
void vApplicationStackOverflowHook( TaskHandle_t pxTask, char *pcTaskName )
{
    ( void ) pcTaskName;
    ( void ) pxTask;

    /* Run time stack overflow checking is performed if
    configCHECK_FOR_STACK_OVERFLOW is defined to 1 or 2.  This hook
    function is called if a stack overflow is detected. */
    taskDISABLE_INTERRUPTS();
    while(1);
}

/// @brief 
/// @param  
void vApplicationIdleHook(void)
{
    /* vApplicationIdleHook() will only be called if configUSE_IDLE_HOOK is set
    to 1 in FreeRTOSConfig.h.  It will be called on each iteration of the idle
    task.  It is essential that code added to this hook function never attempts
    to block in any way (for example, call xQueueReceive() with a block time
    specified, or call vTaskDelay()).  If the application makes use of the
    vTaskDelete() API function (as this demo application does) then it is also
    important that vApplicationIdleHook() is permitted to return to its calling
    function, because it is the responsibility of the idle task to clean up
    memory allocated by the kernel to any task that has since been deleted. */
}

/// @brief 
/// @param  
/// @return 
int main(void)
{
    __enable_irq();

    SystemCoreClockUpdate();
    InitSysClock();
    
    /** Start Timers */
    Timer2Init(1000); // Initialize Timer 2 with 1kHz frequency
    uart_init();


    xTaskCreate(vTaskBlinky, "vBlinky", configMINIMAL_STACK_SIZE, NULL, tskBLINKY_PRIO, NULL);
    xTaskCreate(vTaskUartTx, "vUart", 0x200, NULL, tskUARTTX_PRIO, NULL);
    xTaskCreate(vTaskUartRx, "vUartRx", 0x200, NULL, tskUARTRX_PRIO, NULL);

    vTaskStartScheduler();

    /** Shouldn't get here */
    while (1);

    return ERROR;
}
